app/views/ordems/_form.html.erb

SELECT "clientes".* FROM "clientes"
---
    <%= f.label   :cliente %>
    <%= f.collection_select :cliente_id, Cliente.all, :id,:nome  %>