app/views/fexaords/_form.html.erb

    <%= f.label :ordem %><br />
    <%= f.collection_select :ordem_id, Ordem.all, :id,:id  %>
---
SELECT "ordems".* FROM "ordems"