app/controllers/fexaords_controller.rb

SELECT "fexaords".* FROM "fexaords"
---
  def index
    @fexaords = Fexaord.all

SELECT "fexaords".* FROM "fexaords" WHERE "fexaords"."id" = 1 LIMIT 1
---
  def show
    @fexaord = Fexaord.find(params[:id])

INSERT INTO "fexaords" ("created_at", "ordem_id", "updated_at") VALUES ('2013-06-17 17:45:25.239000', 9, '2013-06-17 17:45:25.239000')
---
  def create
    @fexaord = Fexaord.new(params[:fexaord])

    respond_to do |format|
      if @fexaord.save

SELECT "fexaords".* FROM "fexaords" WHERE "fexaords"."id" = 2 LIMIT 1
DELETE FROM "fexaords" WHERE "fexaords"."id" = 2
---
  def destroy
    @fexaord = Fexaord.find(params[:id])
    @fexaord.destroy