app/controllers/gerente_controller.rb

SELECT "ordems".* FROM "ordems"
---
def index
  @ordems = Ordem.all

SELECT "ordems".* FROM "ordems"
---
def pendentes
  @ordems = Ordem.all

SELECT "usuarios".* FROM "usuarios"
---
def funcionarios
  @usuarios = Usuario.all