app/controllers/ordems_controller.rb

SELECT "ordems".* FROM "ordems"
---
  def index
    @ordems = Ordem.all

SELECT "ordems".* FROM "ordems" WHERE "ordems"."id" = 1 LIMIT 1
---
  def show
    @ordem = Ordem.find(params[:id])

SELECT "ordems".* FROM "ordems" WHERE "ordems"."id" = 1 LIMIT 1
---
  def edit
    @ordem = Ordem.find(params[:id])

INSERT INTO "ordems" ("cliente_id", "created_at", "maquina", "observacoes", "pecas", "updated_at") VALUES (1, '2013-04-11 15:09:28.677000', 'Notebook', 'Trocar', 'Placa de vídeo', '2013-04-11 15:09:28.677000')
---
  def create
    @ordem = Ordem.new(params[:ordem])

    respond_to do |format|
      if @ordem.save

SELECT "ordems".* FROM "ordems" WHERE "ordems"."id" = 5 LIMIT 1
UPDATE "ordems" SET "observacoes" = 'Trocar a memoria ram, Limpar todo o aparelho internamente e exteriormenteTrocar a memoria ram, Limpar todo o aparelho internamente e exteriormenteTrocar a memoria ram, Limpar todo o aparelho internamente e exteriormenteTrocar a memoria ram, Limpar todo o aparelho internamente e exteriormenteTrocar a memoria ram, Limpar todo o aparelho internamente e exteriormenteTrocar a memoria ram, Limpar todo o aparelho internamente e exteriormente', "updated_at" = '2013-05-17 16:59:24.063000' WHERE "ordems"."id" = 10
---
  def update
    @ordem = Ordem.find(params[:id])

    respond_to do |format|
      if @ordem.update_attributes(params[:ordem])

SELECT "ordems".* FROM "ordems" WHERE "ordems"."id" = 1 LIMIT 1
DELETE FROM "ordems" WHERE "ordems"."id" = 1
---
  def destroy
    @ordem = Ordem.find(params[:id])
    @ordem.destroy